# GetMemberIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Group..::..GetMemberIds Method
Group Class See Also
---
Retrieves all the member ElementIds of the group.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<ElementId> GetMemberIds()
```

Visual Basic
---
```text
Public Function GetMemberIds As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetMemberIds()
```

# ### Return Value
An ordered list of the members within the group. The order of this list can be used to match members between other instances of the group.
# See Also
Group Class
Autodesk.Revit.DB Namespace